{
    "top_work_experiences": [
        {
            "work_ex_id": "uuid-2001-aaaa",
            "job_title": "Full Stack Developer",
            "company_name": "Independent / Academic Project",
            "location": "Buffalo, NY",
            "start_date": "2023-02-01",
            "end_date": "2023-08-01",
            "description_bullets": [
                "Developed a scalable real-time stock market analytics platform using React, Flask, and PostgreSQL with AWS deployment.",
                "Integrated multiple financial APIs and WebSocket streams to provide live market updates with sub-second latency.",
                "Implemented dynamic chart visualizations and collaborative watchlists, increasing user engagement by 200+ daily users.",
                "Optimized backend performance through asynchronous processing and query caching, reducing load time by 40%."
            ],
            "score": 0.742
        },
        {
            "work_ex_id": "uuid-2002-bbbb",
            "job_title": "Software Engineer (C++ Developer)",
            "company_name": "University Project – Data Structures Lab",
            "location": "Buffalo, NY",
            "start_date": "2022-10-01",
            "end_date": "2023-01-01",
            "description_bullets": [
                "Implemented a B-Tree–based file management system in C++ for efficient storage and retrieval of musical instrument records.",
                "Designed dynamic indexing mechanisms and delimiter-based record organization to minimize access time.",
                "Enabled CRUD operations with variable-length fields and primary key indexing for faster lookup and modification.",
                "Validated the system through extensive unit and integration testing ensuring correctness and efficiency."
            ],
            "score": 0.701
        },
        {
            "work_ex_id": "uuid-2003-cccc",
            "job_title": "AI Systems Engineer",
            "company_name": "UB Course Planning Research Project",
            "location": "Buffalo, NY",
            "start_date": "2024-01-01",
            "end_date": "2024-05-01",
            "description_bullets": [
                "Built an automated course scheduling and optimization tool using Python, Pandas, and SQLite.",
                "Implemented constraint satisfaction algorithms (backtracking and greedy heuristics) for conflict-free academic scheduling.",
                "Developed a Streamlit-based web interface for interactive student input and visualization of optimal semester plans.",
                "Reduced manual scheduling errors by 95% and improved student planning efficiency across 500+ users."
            ],
            "score": 0.733
        },
        {
            "work_ex_id": "uuid-2004-dddd",
            "job_title": "Machine Learning Engineer",
            "company_name": "Cybersecurity Research Group",
            "location": "Buffalo, NY",
            "start_date": "2024-06-01",
            "end_date": "2024-12-01",
            "description_bullets": [
                "Developed a Machine Learning–based Intrusion Detection System using Python, Scikit-learn, and Pandas.",
                "Trained and optimized a Random Forest classifier achieving 98.5% accuracy on network intrusion datasets.",
                "Performed advanced feature engineering to reduce false positives by 20% and enhance real-time detection speed.",
                "Delivered a lightweight IDS prototype deployable in real-time security monitoring pipelines."
            ],
            "score": 0.765
        }
    ],
    "top_projects": [
        {
            "project_id": "uuid-3001-aaaa",
            "project_name": "Real-Time Stock Market Analytics Platform",
            "repository_url": "https://github.com/username/stock-analytics-platform",
            "description_bullets": [
                "Built a responsive web platform for real-time financial analytics using React (frontend), Flask (backend), and PostgreSQL (database).",
                "Integrated multiple market APIs and enabled live chart updates with less than 1-second refresh latency.",
                "Implemented user authentication and collaborative watchlists for shared data tracking.",
                "Deployed on AWS EC2 with load balancing, achieving 99.9% uptime and 200+ daily active users."
            ],
            "score": 0.748
        },
        {
            "project_id": "uuid-3002-bbbb",
            "project_name": "Music Instrument Management System Using B-Tree Indexing",
            "repository_url": "https://github.com/username/instrument-btree-system",
            "description_bullets": [
                "Designed a file-based management system using B-Tree indexing for efficient data retrieval and modification.",
                "Implemented CRUD operations and primary indexing in C++ for optimized search and record updates.",
                "Utilized delimiter-based variable-length records for improved memory management.",
                "Conducted thorough testing and debugging to ensure robust and efficient file operations."
            ],
            "score": 0.704
        },
        {
            "project_id": "uuid-3003-cccc",
            "project_name": "AI-Powered University Course Planning Tool",
            "repository_url": "https://github.com/username/course-planner-ai",
            "description_bullets": [
                "Developed an AI-based course scheduling system leveraging Python, SQLite, and Streamlit for student academic planning.",
                "Implemented constraint satisfaction and optimization algorithms to resolve course conflicts efficiently.",
                "Provided personalized, semester-by-semester plans improving planning accuracy by 95%.",
                "Enhanced usability through an intuitive web interface enabling instant schedule visualization."
            ],
            "score": 0.735
        },
        {
            "project_id": "uuid-3004-dddd",
            "project_name": "Machine Learning-Based Network Intrusion Detection System (IDS)",
            "repository_url": "https://github.com/username/ml-intrusion-detection",
            "description_bullets": [
                "Developed a supervised ML-based intrusion detection model using Scikit-learn and Pandas for network security monitoring.",
                "Trained models on benchmark datasets (e.g., NSL-KDD) to classify attack types with 98.5% accuracy.",
                "Optimized feature selection to reduce false positives by 20% and improve inference speed.",
                "Deployed the system as a real-time IDS pipeline capable of live network traffic monitoring."
            ],
            "score": 0.762
        }
    ]
}
